[
  {
    "id": 1,
    "slug": "war-of-rhythms",
    "title": "War of Rhythms",
    "description": "Diseño de personaje completo (Biblia de Personaje) para Eigna, la protagonista de un proyecto de animación donde la música es la fuerza vital.",
    "fullDescription": "El proyecto se desarrolla en el planeta Ritmia, donde la música está siendo oprimida por el género GrindCore liderado por el dictador Piggo. Eigna, una joven apasionada por el Punk, vive una doble vida para liderar a su banda, Ynsurgenx, en una lucha por restaurar la libertad musical. El diseño se presenta en un Estilo Cartoon 2D, con características exageradas y proporciones que usan formas cuadradas y triangulares para transmitir agresividad y energía.",
    "role": "Diseño de Personajes & Concept Art",
    "year": "2023",
    "tools": ["Photoshop", "Illustrator", "Clip Studio Paint"],
    "challenge": "El mayor desafío fue traducir la agresividad y energía del género Punk en un diseño cartoon que fuera funcional para animación 2D, equilibrando formas geométricas rígidas con expresividad.",
    "result": "Se logró una Biblia de Personaje completa con giro 360°, expresiones dinámicas (antenas y mejillas reactivas) y una paleta de colores narrativa que define la personalidad de Eigna.",
    "imageUrl": "/images/disenopersonaje.png",
    "pdfLink": "https://drive.google.com/file/d/1BxVuVPe8BEel1vrNE8Am9Jha04pZAvgI/view?usp=sharing",
    "galleryImages": [
      "/images/wof3.jpg",
      "/images/wof2.jpg",
      "/images/wof1.jpg"
    ]
  },
  {
    "id": 2,
    "slug": "animacion-pinterest",
    "title": "Animación Pinterest",
    "description": "Animación del logo de Pinterest aplicando principios de movimiento y fluidez orgánica.",
    "fullDescription": "Este proyecto consistió en la animación del logo de Pinterest realizado para la asignatura de 'Técnicas de Animación'. El objetivo principal fue aplicar los principios de la animación para dar vida a la iconografía distintiva del logo (la letra 'P' que simula un pin).",
    "role": "Motion Graphics",
    "year": "2023",
    "tools": ["After Effects", "Illustrator"],
    "challenge": "Lograr un movimiento fluido y orgánico (evitando el aspecto robótico) mediante el uso avanzado del Graph Editor y curvas de velocidad.",
    "result": "Una pieza de animación fluida que respeta la identidad de la marca, demostrando dominio en la preparación de activos vectoriales y timing.",
    "imageUrl": "/images/pinterest.png",
    "pdfLink": "https://drive.google.com/file/d/1TeZ0sDkLJUaPlODEJT5XEXy1HQ4hx9zB/view?usp=sharing",
    "galleryImages": [
      "/images/pinterest.png",
      "/images/pinterest.gif"
    ]
  },
  {
    "id": 3,
    "slug": "animacion-the-office",
    "title": "Animación The Office",
    "description": "Recreación vectorial y animación de un fragmento de la serie, enfocada en lipsync y acting.",
    "fullDescription": "Recreación y animación vectorial de un fragmento de 15 segundos de The Office. La pieza demuestra un dominio completo del flujo de trabajo 2D: todos los activos, incluyendo personajes y escenarios, fueron diseñados desde cero en vectores listos para animación.",
    "role": "Animación 2D & Ilustración Vectorial",
    "year": "2024",
    "tools": ["After Effects", "Illustrator"],
    "challenge": "La sincronización labial (lipsync) y la orquestación precisa del 'pose a pose' para capturar la esencia cómica y el timing de la serie original.",
    "result": "Una animación de 15 segundos con ejecución técnica sólida, que combina diseño de personajes fiel y movimiento orgánico con estilo Motion Graphics.",
    "imageUrl": "/images/theoffice.png",
    "pdfLink": "https://drive.google.com/file/d/1h3bJi_XxsiueYxdDwmSYpISht2IW1Uj_/view?usp=sharing",
    "galleryImages": [
      "/images/disenopersonaje.png",
      "/images/disenopersonaje.png",
      "/images/pinterest.png"
    ]
  }
]